{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report listing two frontend rollback and fix features with associated files and components.",
  "frontend-file-summaries.txt": "Provides human‑written summaries for all major frontend files, pages, and components.",
  "frontend/index.css": "Tailwind CSS layers and OKLCH-based design tokens defining light/dark themes and global styles.",
  "frontend/index.html": "Base HTML file defining the root element and loading main.tsx via Vite.",
  "frontend/src/App.tsx": "Main React app with hash-based routing, page normalization, and nested error boundaries.",
  "frontend/src/components/ContactForm.tsx": "Netlify-compatible contact form with controlled fields and basic submit handling.",
  "frontend/src/components/DecorativeAccents.tsx": "Renders themed background accent layers based on variant prop.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component providing fallback UI and error logging.",
  "frontend/src/components/Footer.tsx": "Simple footer with DREAMONOMY copyright text and gradient styling.",
  "frontend/src/components/Navbar.tsx": "Responsive navigation bar with mobile menu, scroll styling, and hash navigation.",
  "frontend/src/components/ServiceCard.tsx": "Reusable service card with icon, title, description, and gradient accent.",
  "frontend/src/components/WhyChooseUsContentBox.tsx": "Renders structured “Why Choose Us” content sections with headings, paragraphs, and bullet lists based on provided data.",
  "frontend/src/content/dreamonomyCopy.ts": "Provides centralized marketing copy and structured content for pages including hero text, why-choose-us data, and service descriptions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context with login, logout, and stored identity restoration using Dfinity’s AuthClient.",
  "frontend/src/index.css": "Defines Tailwind base layers, brand color variables, dark mode styles, and reusable component classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers before rendering the root component.",
  "frontend/src/pages/AboutWhyPage.tsx": "Builds the About/Why page using dreamonomyCopy content, decorative components, and responsive sections for story and philosophy.",
  "frontend/src/pages/ContactPage.tsx": "Renders the Contact page with a hero section, intro text from dreamonomyCopy, and a ContactForm component.",
  "frontend/src/pages/HomePage.tsx": "Defines the Home page with a hero section, rotating logo, dynamic hero copy, CTA button, and services preview using dreamonomyCopy content.",
  "frontend/src/pages/ServicesPage.tsx": "Displays the Services page hero and detailed service sections using dreamonomyCopy, with decorative accents and structured content blocks.",
  "frontend/tailwind.config.js": "Tailwind config extending theme colors, fonts, shadows, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project version, goals, constraints, architectural notes, and known issues for updating the DREAMONOMY static site with user-provided content."
}