{
  "backend/main.mo": "Empty Motoko actor with no methods or state.",
  "feature_evidence.json": "Feature evidence listing two frontend updates: replacing services copy structure and updating ServicesPage rendering.",
  "frontend-file-summaries.txt": "Text file mapping frontend file paths to short human-written summaries of their roles.",
  "frontend/index.css": "Tailwind base layer defining CSS variables for light/dark themes and applying global background and text styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component handling hash-based navigation and rendering page components with a shared navbar and footer.",
  "frontend/src/components/ContactForm.tsx": "Netlify-compatible contact form component managing form state and rendering input fields.",
  "frontend/src/components/DecorativeAccents.tsx": "Component that renders background accent layers based on the selected variant.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying DREAMONOMY copyright text in a gradient background container.",
  "frontend/src/components/Navbar.tsx": "Responsive navigation bar with scroll styling, mobile menu, and page navigation logic.",
  "frontend/src/components/ServiceCard.tsx": "Reusable gradient-styled service card showing an icon, title, and description.",
  "frontend/src/content/dreamonomyCopy.ts": "Centralized marketing copy definitions for DREAMONOMY, including homepage text, services descriptions, and structured content blocks.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor instance based on Internet Identity authentication, with reactive query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication provider and hook, handling identity loading, login, logout, and status tracking.",
  "frontend/src/index.css": "Tailwind-based global styles defining brand colors, dark mode variables, typography, and reusable UI component classes.",
  "frontend/src/main.tsx": "Application entry point that initializes React, sets up React Query and Internet Identity providers, and renders the app.",
  "frontend/src/pages/AboutWhyPage.tsx": "Renders the 'Why DREAMONOMY' page using themed sections, decorative components, and content sourced from structured copy.",
  "frontend/src/pages/ContactPage.tsx": "Renders the contact page with a hero section, introductory text, and a contact form using DREAMONOMY's content definitions.",
  "frontend/src/pages/HomePage.tsx": "React homepage rendering hero, rotating logo, CTA, and services section using dreamonomyCopy and decorative components.",
  "frontend/src/pages/ServicesPage.tsx": "Services page that displays services hero text and structured service sections from dreamonomyCopy with decorative accents.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, shadows, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project metadata describing the current site rewrite state, content replacement rules, architecture notes, and known issues."
}