{
  "kind": "build_request",
  "title": "Replace Services page content with provided DREAMONOMY “Our Learning Services” structure",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-32",
      "text": "Update the centralized services copy in `frontend/src/content/dreamonomyCopy.ts` to remove the current placeholder/generic services content (hero title/subtitle, categories array, and CTA copy) and replace it with only the user-provided “SERVICES / Our Learning Services” content and its full structure: intro paragraph, (1) Core Academic Subjects (Elementary K–10) with subject list + “Our Approach” bullets + closing sentence, (2) Out-of-Syllabus & Interdisciplinary Learning (Our USP) with subject list + “These subjects help children” bullets, (3) Responsible AI Education for Children with 2-line positioning + curriculum focus bullets + outcome line, (4) Subject Journaling & Emotional Tracking with journal tracking bullets + “This allows us to” bullets, and “Personalised Growth & Mentorship Programs” with 3 program items + “We help students” bullets.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "now one by one lets change the information lets start by our services let me give you the informatioon for this tab:SERVICES"
        ]
      },
      "acceptanceCriteria": [
        "`dreamonomyCopy.services` no longer contains the current placeholder category cards (e.g., “Creative Services”, “Strategic Planning”, etc.) or the generic CTA copy.",
        "All Services page text in `dreamonomyCopy.services` matches the user-provided SERVICES content (no additional marketing claims or unrelated headings).",
        "The services copy is structured so the Services page can render nested lists (sections -> bullet lists) without hard-coding content in the page component."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Update `frontend/src/pages/ServicesPage.tsx` to render the Services page using the new user-provided services structure from `dreamonomyCopy`, replacing the current generic 6-card grid and the generic CTA section. Keep the existing overall styling approach (responsive layout, current background treatment via `DecorativeAccents`, and existing typography/spacing conventions), but ensure the page displays all provided sections and bullet lists clearly and scannably on desktop/tablet/mobile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "The Services page displays the following visible section headings in order: “Our Learning Services”, “Core Academic Subjects (Elementary K–10)”, “Out-of-Syllabus & Interdisciplinary Learning (Our USP)”, “Responsible AI Education for Children”, “Subject Journaling & Emotional Tracking”, and “Personalised Growth & Mentorship Programs”.",
        "All bullet lists from the user-provided content are rendered as readable lists (not collapsed into a single paragraph).",
        "The old generic service-card grid and the old CTA section (“Need Help Choosing?” / “Get Personalized Recommendations”) are no longer shown.",
        "No backend calls are introduced; the Services page remains fully static and works without server dependencies."
      ]
    }
  ],
  "constraints": [
    "Frontend only; do not add backend functionality (site must remain fully static).",
    "Do not edit any files under `frontend/src/components/ui` or other `frontend.immutablePaths` listed in SYSTEM_CONTEXT.",
    "Use English for all user-facing text; only the user-provided SERVICES copy should appear on the Services page (no extra placeholder text)."
  ],
  "nonGoals": [
    "Changing the Home/About/Contact page copy in this build request.",
    "Adding new navigation items or new pages.",
    "Adding authentication, data persistence, or any dynamic backend-driven services content."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}