{
  "kind": "build_request",
  "title": "Restore last working Dreamonomy site version after broken deployment",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-43",
      "text": "Rollback the frontend to the last known working step/version so the full DREAMONOMY marketing site renders again (Home, About/Why, Services, Contact) with the existing navigation, footer, and page layouts intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "NO NO NO WHOLE SITE IS GONE GO BACK TO LAST STEP PLEASE"
        ]
      },
      "acceptanceCriteria": [
        "The deployed site loads successfully (no blank screen) and renders the Navbar + Footer and a page body on initial load.",
        "All primary routes/pages (Home, About/Why, Services, Contact) are reachable via the existing navigation and render content.",
        "No console errors prevent rendering (no uncaught runtime exceptions on page load)."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Identify and revert the specific change(s) introduced in the latest deployment that caused the site to disappear/break (e.g., routing/rendering logic, missing component export/import, CSS that hides the app root), and ensure the project builds and deploys successfully again.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "WHOLE SITE IS GONE"
        ]
      },
      "acceptanceCriteria": [
        "Frontend build completes successfully without errors.",
        "The root React app mounts and displays visible content above the fold on desktop and mobile viewport sizes.",
        "Hash-based navigation in the existing app shell works again (switching pages does not produce a blank screen)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit immutable hook/bootstrap paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Keep the site fully static with no required backend functionality or server dependencies."
  ],
  "nonGoals": [
    "Do not introduce new features or new pages as part of the rollback.",
    "Do not change DREAMONOMY copy/content beyond what is necessary to restore the last working state.",
    "Do not add or change authentication or backend logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}