{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Dreamonomy marketing site rollback and render recovery (frontend-only)",
  "requirements": [
    {
      "id": "REQ-43",
      "summary": "Restore the last working marketing-site render (Home, About/Why, Services, Contact) with existing navbar/footer/layout and working hash navigation.",
      "acceptanceCriteria": [
        "The deployed site loads successfully (no blank screen) and renders the Navbar + Footer and a page body on initial load.",
        "All primary routes/pages (Home, About/Why, Services, Contact) are reachable via the existing navigation and render content.",
        "No console errors prevent rendering (no uncaught runtime exceptions on page load)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Harden hash-based navigation so the app always renders a page: validate/normalize the hash to a known route, default unknown hashes to Home, and add lightweight aliases for the About/Why route naming (e.g., map \"why\" to \"about\") while preserving the existing navbar/footer/page layout structure."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Confirm the Home page remains renderable under the restored navigation (no reliance on missing props/assets), keeping existing layout and copy intact; only adjust imports/asset references if needed to match the last working static asset structure."
        },
        {
          "path": "frontend/src/pages/AboutWhyPage.tsx",
          "operation": "modify",
          "description": "Confirm the About/Why page renders with its existing layout; only adjust asset references/defensive rendering if needed to avoid runtime failures and keep the page accessible via the restored hash navigation."
        },
        {
          "path": "frontend/src/pages/ServicesPage.tsx",
          "operation": "modify",
          "description": "Confirm the Services page renders reliably (no runtime crashes from missing data or invalid maps), preserving existing layout/copy and ensuring it is reachable via the existing navbar navigation."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Confirm the Contact page renders reliably with the existing contact form and layout; only make minimal defensive adjustments if required to prevent blank-screen failures."
        }
      ]
    },
    {
      "id": "REQ-44",
      "summary": "Revert/neutralize the breaking change(s) from the latest deployment that caused the site to disappear, ensuring the React app mounts visibly and hash navigation switches pages without blank screens.",
      "acceptanceCriteria": [
        "Frontend build completes successfully without errors.",
        "The root React app mounts and displays visible content above the fold on desktop and mobile viewport sizes.",
        "Hash-based navigation in the existing app shell works again (switching pages does not produce a blank screen)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ErrorBoundary.tsx",
          "operation": "create",
          "description": "Add a simple React error boundary component to prevent a single rendering exception from blanking the entire app; it should show a minimal fallback UI while keeping Navbar/Footer visible."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the page body rendering with the new ErrorBoundary and add a final render fallback (e.g., if the selected page component fails to resolve) so the app never renders an empty <main> due to invalid route state."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Ensure global layout cannot collapse/hide the app root: add/confirm safe defaults for html/body/#root sizing and visibility so the mounted React tree is visible above the fold across common viewport sizes, without altering the existing site look beyond what is necessary for recovery."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Verify the HTML mount structure remains correct for Vite/React (root element present and script reference intact); only apply minimal corrections if the latest deployment modified the mount container or script tag in a way that would prevent mounting."
        }
      ]
    }
  ]
}