{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace Why Choose Us card grids with single paragraph-style box using provided copy",
  "requirements": [
    {
      "id": "REQ-37",
      "summary": "Replace placeholder “Why Choose Us” copy in centralized content with the user-provided text, preserving headings and bullet list structures verbatim.",
      "acceptanceCriteria": [
        "`dreamonomyCopy` no longer contains the current placeholder Why Choose Us cards/features/reasons text for the sections being updated.",
        "The new “Why Choose Us” copy is stored verbatim, including the exact capitalization, punctuation, headings, and bullet items as provided by the user.",
        "The stored structure preserves bullet lists as lists (not flattened into a single sentence) so the UI can render them clearly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/dreamonomyCopy.ts",
          "operation": "modify",
          "description": "Update `homepage.whyChooseUs` and `about.whyChooseUs` to remove the placeholder card/reasons data and replace it with a structured representation of the provided “WHY CHOOSE US” content (headings, paragraphs, and bullet lists preserved verbatim so the UI can render lists as lists)."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Update Home page Why Choose Us section to render a single large paragraph-style content box matching the Message from the Founder styling, using the new structured copy with headings and bullet lists.",
      "acceptanceCriteria": [
        "The Home page “Why Choose Us” section no longer renders a grid of three feature cards.",
        "The Home page “Why Choose Us” section renders exactly one primary content container (a single box) that visually matches the “Message from the Founder” container styling.",
        "Inside the box, the user-provided text is fully visible on desktop/tablet/mobile with no truncation/cut-off, and bullet points render as a list.",
        "No extra AI-created headings/subheadings are added beyond what the user provided."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WhyChooseUsContentBox.tsx",
          "operation": "create",
          "description": "Create a reusable renderer component for the structured “Why Choose Us” copy (render headings, paragraphs, and bullet lists with readable spacing, ensuring no truncation on any breakpoint)."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Replace the existing “Why Choose Us” 3-card grid rendering with a single rounded/padded/bordered-shadowed container styled to match the existing “Message from the Founder” box, and render the new structured `homepage.whyChooseUs` content inside it using `WhyChooseUsContentBox`."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Update About/Why page Why Choose Us section to render the same single large paragraph-style content box (matching the Message from the Founder styling) using the same structured copy.",
      "acceptanceCriteria": [
        "The About/Why page “Why Choose Us” section no longer renders a grid of multiple reason cards.",
        "The About/Why page “Why Choose Us” section renders exactly one primary content container (a single box) consistent with the “Message from the Founder” container styling on that page.",
        "The complete provided Why Choose Us content (headings + paragraphs + bullets) is rendered with readable spacing and no truncation at any breakpoint."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AboutWhyPage.tsx",
          "operation": "modify",
          "description": "Replace the existing “Why Choose Us” reasons grid with a single rounded/padded/bordered-shadowed container consistent with that page’s “Message from the Founder” box styling, and render the structured `about.whyChooseUs` content inside it using `WhyChooseUsContentBox`."
        }
      ]
    }
  ]
}